"""
Задание:

Сделать 2 коммита:
1) До правок читаемости кода по PEP8
2) После правок читаемости кода по PEP8

"""

"""
В данном задании, с помощью изученого материала по PEP8 было улучшено:
1) Многострочные комментарии были оформлены иначе, что позволило улучшить читаемость и разделение блоков кода по заданиям
2) Добавлена 1 строка между методами класса для улучшения читаемости
3) Убраны лишние строки в функциях и циклах, которые никак не влияли на читаемость

Так же согласно PEP8 E721 типы необходимо сравнивать isinstance(), но в моем случае это не нужно.

"""