"""Задание 1:

Посчитать пример из задания

"""

x = (18 + (1 / 10)) * (30 + (33 / 44) + 50 + (55 / 88)) / (9 / 10)
print(x)

"""Задание 2:

Вычислить сумму ряда (0 - 88888888)

"""

sumNumRow = sum(range(0, 88888888))
print(sumNumRow)

"""Задание 3:

Вычислить среднее арифметическое ряда [3, 4, 56, 100, 2, 2, 3]

"""

numRow = [3, 4, 56, 100, 2, 2, 3]
average = sum(numRow) / len(numRow)
print(average)
